# -*- mode: ruby -*-
# vi: set ft=ruby :

tap "argoproj/tap"
tap "c-bata/kube-prompt"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "nektos/tap"
tap "versent/taps"
tap "weaveworks/tap"
tap "yoheimuta/protolint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automate deployment, configuration, and upgrading
brew "ansible"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Record and share terminal sessions
brew "asciinema"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Package for scientific computing with Python
brew "numpy"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Interface bandwidth monitor
brew "bmon"
# Collection of portable C++ source libraries
brew "boost"
# Increase version numbers with SemVer terms
brew "bumpversion"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# CloudFlare's PKI toolkit
brew "cfssl"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# Reimplementation of ctags(1)
brew "ctags"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Run a command as a UNIX daemon
brew "daemonize"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Generate documentation for several programming languages
brew "doxygen"
# Distributed search & analytics engine
brew "elasticsearch"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# HTTP/2 C Library
brew "nghttp2"
# GNU Emacs text editor
brew "emacs", link: false
# Interpreter for PostScript and PDF
brew "ghostscript"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Image manipulation
brew "netpbm"
# Translates figures generated by xfig to other formats
brew "fig2dev"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# C++ geography library
brew "geographiclib"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Powerful, lightweight programming language
brew "lua"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# Tool Command Language
brew "tcl-tk"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# SDK for Groovy: a Java-based scripting language
brew "groovysdk"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# File format designed to store large amounts of data
brew "hdf5"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Display an interface's bandwidth usage
brew "iftop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# Library that provides automatic proxy configuration management
brew "libproxy"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Next-gen compiler infrastructure
brew "llvm"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Run a Kubernetes cluster locally
brew "minikube"
# Cross platform, open source .NET development framework
brew "mono"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple NodeJS versions
brew "nodenv"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Fast updates of QR and Cholesky decompositions
brew "qrupdate"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# High-level interpreted language for numerical computing
brew "octave"
# OCaml package manager
brew "opam"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Check coding standards in PHP, JavaScript and CSS
brew "php-code-sniffer"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Emulator for x86 and PowerPC
brew "qemu", link: false
# Software environment for statistical computing
brew "r"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Browser automation for testing purposes
brew "selenium-server"
# HTTP regression testing and benchmarking utility
brew "siege"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# View colored diff with side by side and auto pager support
brew "ydiff"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# An interactive kubernetes client featuring auto-complete using go-prompt.
brew "c-bata/kube-prompt/kube-prompt"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# Run GitHub Actions locally
brew "nektos/tap/act"
brew "versent/taps/saml2aws"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Pluggable tool to enforce Protocol Buffer style and conventions
brew "yoheimuta/protolint/protolint"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
# Network scanner
cask "angry-ip-scanner"
# Text editor
cask "atom"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# GUI Client for GRPC Services
cask "bloomrpc"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Free and open-source web browser
cask "chromium"
# Clipboard extension app
cask "clipy"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Text editor
cask "emacs"
# Web browser
cask "firefox"
cask "font-myrica"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
cask "google-backup-and-sync"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "google-japanese-ime"
# Vector graphics editor
cask "inkscape"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
cask "mendeley-desktop"
# Interactive computing suite
cask "nteract"
# Collaboration platform for API development
cask "postman"
# Data science software focusing on R and Python
cask "rstudio"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Unpacks archive files
cask "the-unarchiver"
# Customizable email client
cask "thunderbird"
# Configurable document editor that supports Markdown
cask "typora"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
cask "winzip"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
